Revit 2024 API
Marble.MarbleWidth Property
 The property labeled "Vein Width" from the "Marble" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MarbleWidth { get; }
Visual Basic
Public Shared ReadOnly Property MarbleWidth As String
	Get
Visual C++
public:
static property String^ MarbleWidth {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1".
See Also
Marble Class
Autodesk.Revit.DB.Visual Namespace